---
type: RebarShapeConstraint
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# RebarShapeConstraint

`Autodesk.Revit.DB.Structure.RebarShapeConstraint` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetParamId | 2012 | `public ElementId GetParamId ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |